In [1]:
%load_ext sql
%sql mysql+mysqlconnector://root:root@localhost

In [2]:
%%sql

use 30days

 * mysql+mysqlconnector://root:***@localhost
0 rows affected.

[]

In [89]:
%%sql
drop table if exists orders;
CREATE TABLE orders (
    order_id   INT PRIMARY KEY,
    product_id INT NOT NULL,
    category   VARCHAR(50) NOT NULL,
    order_date DATE NOT NULL,
    quantity   INT NOT NULL,
    price      INT NOT NULL
);

 * mysql+mysqlconnector://root:***@localhost
0 rows affected.
0 rows affected.

[]

In [91]:
%%sql

INSERT INTO orders (order_id, product_id, category, order_date, quantity, price)
VALUES
(1, 1001, 'Electronics', '2024-01-05', 1, 50000),
(2, 1002, 'Electronics', '2024-01-06', 2, 30000),
(3, 1003, 'Electronics', '2024-01-10', 1, 70000),
(4, 1001, 'Electronics', '2024-01-15', 1, 50000),
(5, 2001, 'Clothing',    '2024-01-07', 3, 2000),
(6, 2002, 'Clothing',    '2024-01-09', 2, 3000),
(7, 2003, 'Clothing',    '2024-01-12', 5, 1500),
(8, 3001, 'Books',       '2024-01-08', 4, 500),
(9, 3002, 'Books',       '2024-01-11', 6, 400),
(10,3001, 'Books',       '2024-01-18', 2, 500),
(11, 1004, 'Electronics', '2024-01-15', 2, 50000);

 * mysql+mysqlconnector://root:***@localhost
11 rows affected.

[]

In [92]:
%%sql

SELECT * FROM orders
ORDER BY order_date;

 * mysql+mysqlconnector://root:***@localhost
11 rows affected.

[(1, 1001, 'Electronics', datetime.date(2024, 1, 5), 1, 50000),
 (2, 1002, 'Electronics', datetime.date(2024, 1, 6), 2, 30000),
 (5, 2001, 'Clothing', datetime.date(2024, 1, 7), 3, 2000),
 (8, 3001, 'Books', datetime.date(2024, 1, 8), 4, 500),
 (6, 2002, 'Clothing', datetime.date(2024, 1, 9), 2, 3000),
 (3, 1003, 'Electronics', datetime.date(2024, 1, 10), 1, 70000),
 (9, 3002, 'Books', datetime.date(2024, 1, 11), 6, 400),
 (7, 2003, 'Clothing', datetime.date(2024, 1, 12), 5, 1500),
 (4, 1001, 'Electronics', datetime.date(2024, 1, 15), 1, 50000),
 (11, 1004, 'Electronics', datetime.date(2024, 1, 15), 2, 50000),
 (10, 3001, 'Books', datetime.date(2024, 1, 18), 2, 500)]

In [61]:
%%sql

select category, product_id, (quantity * price) as total_revenue
from orders

 * mysql+mysqlconnector://root:***@localhost
10 rows affected.

[('Electronics', 1001, 50000),
 ('Electronics', 1002, 60000),
 ('Electronics', 1003, 70000),
 ('Electronics', 1001, 50000),
 ('Clothing', 2001, 6000),
 ('Clothing', 2002, 6000),
 ('Clothing', 2003, 7500),
 ('Books', 3001, 2000),
 ('Books', 3002, 2400),
 ('Books', 3001, 1000)]

In [62]:
%%sql

WITH t AS (
    select category, 
    product_id, 
    (quantity * price) as total_revenue

    from orders

)
SELECT category, 
    product_id, 
    max(total_revenue) over(
        partition by category
    ) as tot
FROM t

 * mysql+mysqlconnector://root:***@localhost
10 rows affected.

[('Books', 3001, 2400),
 ('Books', 3002, 2400),
 ('Books', 3001, 2400),
 ('Clothing', 2001, 7500),
 ('Clothing', 2002, 7500),
 ('Clothing', 2003, 7500),
 ('Electronics', 1001, 70000),
 ('Electronics', 1002, 70000),
 ('Electronics', 1003, 70000),
 ('Electronics', 1001, 70000)]

In [63]:
%%sql

WITH t AS (
    select category, 
    product_id, 
    (quantity * price) as total_revenue

    from orders

)

SELECT category, 
    max(total_revenue) as tot
FROM t group by category limit 2

 * mysql+mysqlconnector://root:***@localhost
2 rows affected.

[('Electronics', 70000), ('Clothing', 7500)]

In [81]:
%%sql

select 
     category, 
    product_id, 
    tot
from(

WITH t AS (
    select category, 
    product_id, 
    (quantity * price) as total_revenue

    from orders

)
SELECT category, 
    product_id, 
    max(total_revenue) over(
        partition by category
    ) as tot,
    ROW_NUMBER() over(
        partition by category
        order by total_revenue desc
    )  as rn
from t
) x where rn = 1 
order by tot desc 
limit 2;

 * mysql+mysqlconnector://root:***@localhost
2 rows affected.

[('Electronics', 1003, 70000), ('Clothing', 2003, 7500)]

In [96]:
%%sql

With t AS (
    select 
        category, 
        product_id, 
        (quantity * price) as total_revenue
    from orders
),
ranked as (
    select 
        category, 
        product_id, 
        total_revenue,
        row_number() over(
            partition by category
            order by total_revenue desc
        ) as rn
    from t
) 

select 
    category, 
    product_id, 
    total_revenue 
from ranked
where rn <= 2

 * mysql+mysqlconnector://root:***@localhost
6 rows affected.

[('Books', 3002, 2400),
 ('Books', 3001, 2000),
 ('Clothing', 2003, 7500),
 ('Clothing', 2001, 6000),
 ('Electronics', 1004, 100000),
 ('Electronics', 1003, 70000)]

In [93]:
%%sql

# my ans

WITH t AS (
    SELECT
        category,
        product_id,
        sum((quantity * price)) AS total_revenue
    FROM orders
    group by category, product_id
),
ranked AS (
    SELECT
        category,
        product_id,
        total_revenue,
        ROW_NUMBER() OVER (
            PARTITION BY category
            ORDER BY total_revenue DESC
        ) AS rn
    FROM t
)
SELECT category, product_id, total_revenue
FROM ranked
WHERE rn <= 3
order by  total_revenue desc

 * mysql+mysqlconnector://root:***@localhost
8 rows affected.

[('Electronics', 1001, Decimal('100000')),
 ('Electronics', 1004, Decimal('100000')),
 ('Electronics', 1003, Decimal('70000')),
 ('Clothing', 2003, Decimal('7500')),
 ('Clothing', 2001, Decimal('6000')),
 ('Clothing', 2002, Decimal('6000')),
 ('Books', 3001, Decimal('3000')),
 ('Books', 3002, Decimal('2400'))]

In [94]:
%%sql

## gpt 

WITH product_revenue AS (
    SELECT
        category,
        product_id,
        SUM(quantity * price) AS total_revenue
    FROM orders
    GROUP BY category, product_id
),
ranked_products AS (
    SELECT
        category,
        product_id,
        total_revenue,
        DENSE_RANK() OVER (
            PARTITION BY category
            ORDER BY total_revenue DESC
        ) AS rn
    FROM product_revenue
)
SELECT
    category,
    product_id,
    total_revenue
FROM ranked_products
WHERE rn <= 3;

 * mysql+mysqlconnector://root:***@localhost
9 rows affected.

[('Books', 3001, Decimal('3000')),
 ('Books', 3002, Decimal('2400')),
 ('Clothing', 2003, Decimal('7500')),
 ('Clothing', 2001, Decimal('6000')),
 ('Clothing', 2002, Decimal('6000')),
 ('Electronics', 1001, Decimal('100000')),
 ('Electronics', 1004, Decimal('100000')),
 ('Electronics', 1003, Decimal('70000')),
 ('Electronics', 1002, Decimal('60000'))]

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql